programmingTutorial04AdvancedTutorial09/run/001-2D-Pipe-ParabolicBC/case1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    INLET
    {
        type            patch;
        nFaces          24;
        startFace       2279;
    }
    OUTLET
    {
        type            patch;
        nFaces          24;
        startFace       2303;
    }
    WALL
    {
        type            wall;
        inGroups        1(wall);
        nFaces          98;
        startFace       2327;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2352;
        startFace       2425;
    }
)

// ************************************************************************* //
